spec/cassettes/Student_views_payment_index_page/after_a_payment_has_been_made_with_credit_card/shows_payment_history_with_correct_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4111111111111111","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:24:58 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMde8455e4644f11e4a20002a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQHHVYAUgJQAVtXBwdXVlQBAhxEU1sOHRdEVFMFUVRRBQQAVAoBCl0HBxFJGQdQDUAHOQ==
      Content-Length:
      - '1266'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6RTr0jkEV3QaKfskF8paUM",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-04T18:25:10.188717Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6RTr0jkEV3QaKfskF8paUM",
              "created_at": "2014-11-04T18:25:10.188715Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:24:58 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6RTr0jkEV3QaKfskF8paUM
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:24:58 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe20af5ce644f11e495990230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      Content-Length:
      - '564'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6RTr0jkEV3QaKfskF8paUM",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-04T18:25:10.188717Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6RTr0jkEV3QaKfskF8paUM",
              "created_at": "2014-11-04T18:25:10.188715Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:24:58 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4111111111111111","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:25:00 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe2374520644f11e4ba8502a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQDHVINWQdZAVJWBAdYUlQKBQZIQVAOCBtGRlNXUARVW1sIV1paDwkFAQFHFUFXAF8RAWs=
      Content-Length:
      - '1266'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6UIjotxq9BkmTeNYrjua33",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-04T18:25:12.703304Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6UIjotxq9BkmTeNYrjua33",
              "created_at": "2014-11-04T18:25:12.703303Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:25:00 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6UIjotxq9BkmTeNYrjua33
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:25:01 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe37c2090644f11e4910006429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      Content-Length:
      - '564'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6UIjotxq9BkmTeNYrjua33",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-04T18:25:12.703304Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6UIjotxq9BkmTeNYrjua33",
              "created_at": "2014-11-04T18:25:12.703303Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:25:01 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6UIjotxq9BkmTeNYrjua33
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:25:01 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe3df8446644f11e4bc0006429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      Content-Length:
      - '564'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6UIjotxq9BkmTeNYrjua33",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-04T18:25:12.703304Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6UIjotxq9BkmTeNYrjua33",
              "created_at": "2014-11-04T18:25:12.703303Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:25:02 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6UIjotxq9BkmTeNYrjua33/debits
    body:
      encoding: UTF-8
      string: '{"amount":61821,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 04 Nov 2014 18:25:04 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe446a84c644f11e4910006429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.39
      Content-Length:
      - '1085'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "CC6UIjotxq9BkmTeNYrjua33",
                "card_hold": "HL6WUIrzoQmoHkajWmHSvOKc",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-11-04T18:25:16.155668Z",
              "created_at": "2014-11-04T18:25:14.685397Z",
              "transaction_number": "W2MX-CBX-Q4TN",
              "failure_reason": null,
              "currency": "USD",
              "amount": 61821,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD6WWnN6ZcLb4Z1iHKIfpdja",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD6WWnN6ZcLb4Z1iHKIfpdja"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:25:04 GMT
- request:
    method: post
    uri: https://api:key-6i28pis-hiythfyhqx-njd6gv4a2xuy3@api.mailgun.net/v2/epicodus.com/messages
    body:
      encoding: US-ASCII
      string: from=michael%40epicodus.com&to=student35%40example.com&bcc=michael%40epicodus.com&subject=Epicodus%20tuition%20payment%20receipt&text=Hi%20Example%20Brown%2035.%20This%20is%20to%20confirm%20your%20payment%20of%20%24618.21%20for%20Epicodus%20tuition.%20If%20you%20have%20any%20questions%2C%20reply%20to%20this%20email.%20Thanks!
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Content-Length:
      - '327'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.4.7
      Date:
      - Tue, 04 Nov 2014 18:25:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '90'
      Connection:
      - keep-alive
      Content-Disposition:
      - inline
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '600'
      Access-Control-Allow-Methods:
      - GET, POST, PUT, DELETE, OPTIONS
      Access-Control-Allow-Headers:
      - Content-Type, x-requested-with
    body:
      encoding: UTF-8
      string: |-
        {
          "message": "Queued. Thank you.",
          "id": "<20141104182504.108093.5688@epicodus.com>"
        }
    http_version: 
  recorded_at: Tue, 04 Nov 2014 18:25:04 GMT
recorded_with: VCR 2.9.3
